{
  "greeting": "مرحبًا بك في معرض أعمالي",
  "about": "من أنا",
  "experience": "الخبرات",
  "projects": "المشاريع",
  "contact": "تواصل",
  "toggle": "English",
  "about_title": "من أنا",

  "hero_heading": "مرحبًا، أنا طه",
  "hero_subtitle": "أبني أشياء مميزة للويب.",
  "hero_subtitle_two": "أنا مهندس برمجيات متخصص في بناء (وأحيانًا تصميم) تجارب رقمية استثنائية. أركز حاليًا على بناء تطبيقات ومواقع ويب سهلة الوصول.",

  "about_description": "مرحباً! اسمي طه وأنا أستمتع بإنشاء أشياء تعيش على الإنترنت. بدأ اهتمامي بتطوير الويب في عام 2017 عندما قررت تجربة تعديل قوالب تمبلر المخصصة — اتضح أن التجربة واللعب بقوالب تمبلر علمني الكثير عن HTML وCSS!",
  "about_description_two": "ننتقل سريعًا إلى اليوم، لقد حظيت بشرف العمل في وكالة إعلانية، شركة ناشئة، مؤسسة ضخمة، واستوديو تصميم يديره طلاب. تركيزي الرئيسي هذه الأيام هو بناء منتجات وتجارب رقمية سهلة الوصول وشاملة في",
  "about_description_company": "انجوسوفت",
  "about_description_clients": "لمجموعة متنوعة من العملاء.",
  "about_skills_title": "إليك بعض التقنيات التي عملت عليها مؤخرًا:",

  "exp": "أين عملت",
  "jobs": {
    "engosoft": {
      "company": "انجوسوفت",
      "role": "مطور Odoo",
      "period": "مايو 2023 - الحاضر",
      "details": [
        "تقديم كود إنتاجي عالي الجودة وقوي لمجموعة متنوعة من المشاريع",
        "العمل جنبًا إلى جنب مع المديرين الإبداعيين لقيادة البحث والتطوير وبناء الحلول التقنية لتلبية احتياجات العمل",
        "التعاون مع المصممين ومديري المشاريع والمهندسين الآخرين لتحويل المفاهيم الإبداعية إلى واقع إنتاجي للعملاء والمعنيين",
        "توفير القيادة داخل قسم الهندسة من خلال التعاون الوثيق ومشاركة المعرفة والإرشاد"
      ]
    },
    "rayaAcademy": {
      "company": "رايا اكاديمى",
      "role": "مدرب",
      "period": "يناير - مايو 2023",
      "details": [
        "كنت أدرّب في أكاديمية راية، وهي مركز تعليمي متخصص",
        "تم التدريب في المجالات التالية: البرمجة، الشبكات، وأمن المعلومات",
        "كما درّبت أكثر من 200 طالب وطالبة في الكلية الكندية خلال برنامجهم التدريبي الصيفي في الكلية"
      ]
    }
  },

  "projects_section_title": "المشاريع",
  "project_view": "عرض المشروع ←",

  "project_title_portfolio": "موقع المعرض الشخصي",
  "project_desc_portfolio": "موقع شخصي مبني باستخدام Next.js وTailwind CSS، يتميز بتصميم متجاوب وخاصية تبديل السمات (الوضع الفاتح/الداكن)، وتمت إضافة بعض اللمسات المتحركة الجميلة باستخدام Framer Motion.",

  "project_title_lms": "منصة انجوسوفت ",
  "project_desc_lms": "منصة تعليمية إلكترونية متكاملة وقوية، مبنية باستخدام نظام Odoo ERP. نقدم تجربة تعليمية سلسة وفعالة، تشمل إدارة الدورات، وتتبع تقدم الطلاب، والتواصل التفاعلي، بالإضافة إلى إدارة شاملة للعمليات التعليمية بفضل تكاملها مع Odoo.",

  "project_title_ui_library": "تطبيق دراكو",
  "project_desc_ui_library": "مكونات قابلة لإعادة الاستخدام مبنية باستخدام Next.js و Tailwind CSS، وتستخدم في الأدوات والتطبيقات الداخلية",

  "project_title_ui_React": "ريأكت",
  "project_desc_ui_React": "مكونات قابلة لإعادة الاستخدام مبنية باستخدام React و Tailwind CSS، وتستخدم في الأدوات والتطبيقات الداخلية",

  "whats_title": "للتواصل",
  "whats_desc": "على الرغم من أنني لا أبحث حاليًا عن أي فرص جديدة، إلا أن صندوق رسائلي مفتوح دائمًا. سواء كان لديك سؤال أو أردت فقط إلقاء التحية، سأبذل قصارى جهدي للرد عليك!",
  "whats_app": "انقر هنا لنتواصل عبر الواتساب، وسأرد فوراً",
  "linked_in": "للتواصل بخصوص فرص العمل والتعاون في مشاريع مثيرة،زور ملفي الشخصي على لينكد إن.",
  "git_hup": "من تصميم الواجهات للتطبيق،كل كودي هنا على GitHub.أنتظر تواصلك واقتراحاتك.",

  "contact_title": "تواصل معي",
  "contact_description": "عندك سؤال، فكرة، أو فرصة؟ خلينا نتواصل! املأ النموذج أدناه وسأتواصل معك قريبًا.",
  "form_name": "الاسم",
  "form_email": "البريد الإلكتروني",
  "form_message": "الرسالة",
  "form_submit": "إرسال الرسالة",
  "footer_rights": "©  صُمم بواسطة طه. جميع الحقوق محفوظة.",

  "toast_messga_seccess": "✅ نجع فى الارسال!",
  "toast_messga_failed": "❌ فشل فى الارسال!"
}
